samples/req2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ubic="http://ubicaplus.webservice.com" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="TS-CC1407D98F86D10162166429229179736"><wsu:Created>2022-09-27T15:24:51.797Z</wsu:Created><wsu:Expires>2022-09-27T18:11:31.797Z</wsu:Expires></wsu:Timestamp><ds:Signature Id="SIG-CC1407D98F86D10162166429229179235" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ubic xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-CC1407D98F86D10162166429229179234"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ubic xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>7+W0ZMUXU6FE9cIN+yAcEE4YNVs=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>T+1179U1iEOOoDVEU0RrQl4NPmE22I2c1BdNhnE3UcP8fLeZn4MT4VczvPuFnR3VMkRbjEK7F7jl0F4dRqu4rlJuKdbPr1CQphPZ2Jq+W8Chni903a8pYurKiWLx3TR5cerT+lGP8DnSBMpJu5p8H57cx0NEGHiFBGnftSLwiXuQO5mkibIhCXZsZ/yGwdmGQNIVRINvIozHtgRFpvNkXPdz4H1frKKknE2dDT+jeORceaywNYzUH7mEGpJFd9GOsfeSxYMQ+EqoytRS3qa3SFDNcefDCXB3SRrP0IMIKe0eqwbiB8y/I08ETiM0AOWojY8M4G2zyfPsTuIG0OmBvg==</ds:SignatureValue><ds:KeyInfo Id="KI-CC1407D98F86D10162166429229179232"><wsse:SecurityTokenReference wsu:Id="STR-CC1407D98F86D10162166429229179233"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=equidadtes</ds:X509IssuerName><ds:X509SerialNumber>662525258</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body wsu:Id="id-CC1407D98F86D10162166429229179234" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ubic:consultaUbicaPlus soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><parametrosUbica xsi:type="dto:ParametrosUbicaPlusDTO" xmlns:dto="http://dto.ubicaplus.webservice.com"><codigoInformacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">5632</codigoInformacion><motivoConsulta xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">24</motivoConsulta><numeroIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">262744</numeroIdentificacion><primerApellido xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">SEPULVEDA</primerApellido><tipoIdentificacion xsi:type="soapenc:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">1</tipoIdentificacion></parametrosUbica></ubic:consultaUbicaPlus></soapenv:Body></soapenv:Envelope>