samples/action.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="TS-b8a55ff0-8bf0-4f96-8c19-79f228d89ad3"><wsu:Created>2022-10-01T10:08:59.351Z</wsu:Created><wsu:Expires>2022-10-01T10:13:59.351Z</wsu:Expires></wsu:Timestamp><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-ac1f1bbd-258e-4ce8-862c-ac517e1ce911"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#TS-b8a55ff0-8bf0-4f96-8c19-79f228d89ad3"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>RiEDdejK4mt5i7kWfekrjmgnRPU=</ds:DigestValue></ds:Reference><ds:Reference URI="#id-f74a3e35-44b2-4993-90fa-d1e1bd584219"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>brUF7nVMqmVXqXPDRHtuGUxlyTU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Y2Pm+K7LoIgAnpwSDe27beDeIS+DUbA0Buc07GJId3Q1PsG3w5ma4Kpl2aj80Qp64C8vCdiKS0D8&#xd;
B+4MAMlO7p7xvLaTR86m8zdtf98pcIMMYQjt5c4GUuIc5NOKi76KsvSJcdhhJ2dm84/thi1jEv2E&#xd;
Tx/YM12bkX+g2OCLKzs57tKq3iDUUA8xrnpGPjZS0VdLTRQAE6JWVOm23JtKyabYktDD+MsibtVI&#xd;
KzhIzQwpk5lr7CPzyl7W7eHri21yH/9ZCCHKQJ6jQhvsHXStpUO5eeA3s5bvQorHyNhPXOY6PHMz&#xd;
zL2Yymu3pHSGma7huiQExT+zMldfbfYCGTJx3A==</ds:SignatureValue><ds:KeyInfo Id="KI-87f720ef-f53e-4d00-95c0-bda496ac4339"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STR-401b9de0-87ba-4b2f-8f73-9b6880da2394"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=equidadtes</ds:X509IssuerName><ds:X509SerialNumber>662525258</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-f74a3e35-44b2-4993-90fa-d1e1bd584219"><ns1:consultaUbicaPlus xmlns:ns1="http://ubicaplus.webservice.com"><parametrosUbica xmlns:ns2="http://schemas.xmlsoap.org/soap/encoding/"><codigoInformacion>5632</codigoInformacion><motivoConsulta>24</motivoConsulta><numeroIdentificacion xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><primerApellido xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><tipoIdentificacion>1</tipoIdentificacion></parametrosUbica></ns1:consultaUbicaPlus></soap:Body></soap:Envelope>